stm32-hotspot/STM32WB-ZB-RUC-WindowCovering/Projects/P-NUCLEO-WB55.Nucleo/RUC/Zigbee/Zigbee_Coord/STM32_WPAN/App/app_zigbee.c
/**
  ******************************************************************************
  * @file    app_zigbee.c
  * @author  Zigbee Application Team
  * @brief   Zigbee Part only
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "tl_zigbee_hci.h"
#include "shci.h"
#include "stm32wbxx_core_interface_def.h"
#include "stm32_seq.h"

/* Debug Part */
#include <assert.h>
#include "stm_logging.h"
#include "dbg_trace.h"

/* service dependencies */
#include "app_core.h"
#include "app_nvm.h"
#include "app_zigbee.h"

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY  500U
#define CHANNEL                        25
#define CHANNELMASK_USED               (1<< CHANNEL)
// #define CHANNELMASK_USED               WPAN_CHANNELMASK_2400MHZ; /* Full Channel in use */

/* Private function prototypes -----------------------------------------------*/
static enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);
static void App_Zigbee_NwkForm       (void);
static uint8_t App_Zigbee_Get_Channel(uint32_t mask, uint16_t *first_channel);
static void App_Zigbee_Permit_Join_cb(struct ZbZdoPermitJoinRspT *rsp, void *arg);
static void App_Zigbee_Set_TxPwr       (int8_t updated_val_tx_power);
static void App_Zigbee_Unbind_cb     (struct ZbZdoBindRspT *rsp, void *cb_arg);
static void App_Zigbee_TraceError    (const char *pMess, uint32_t ErrCode);

/* M4-M0 communication */
static void Wait_Getting_Ack_From_M0    (void);
static void Receive_Ack_From_M0         (void);
static void Receive_Notification_From_M0(void);

/* Private variables ---------------------------------------------------------*/
static int8_t           tx_power = 0;
static TL_CmdPacket_t * p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t * p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t * p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t    CptReceiveNotifyFromM0 = 0;
static __IO uint32_t    CptReceiveRequestFromM0 = 0;

/* Buffer memories */
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t     ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer [sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];


/* Shared variables -------------------------------------------------------- */
/* zigbee info, it could be used globally for the application */
App_Zb_Info_T app_zb_info;


/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Zigbee part initialization
 * Setting different services needed to use/call stack and network Zigbee
 * 
 * @param  None
 * @retval None
 */
void App_Zigbee_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_ZB_DBG("App_Zigbee_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZB_DBG("**********************************************************");
  App_Zigbee_Check_Firmware_Info();
  APP_ZB_DBG("**********************************************************");

  /* Register cmdbuffer */
  App_Zigbee_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  App_Zigbee_TL_INIT();

  /* Flash Init */
  App_NVM_Init();

  /* Create the different tasks */
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4,  UTIL_SEQ_RFU, App_Zigbee_ProcessNotifyM0ToM4);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, UTIL_SEQ_RFU, App_Zigbee_ProcessRequestM0ToM4);

  /* Task associated with network creation process */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, UTIL_SEQ_RFU, App_Zigbee_NwkForm);

  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);
} /* App_Zigbee_Init */

/**
 * @brief Check and display the M0 Firmware type loaded,
 *        the application name and the Link key value
 * 
 * @param  None
 * @retval None
 */
void App_Zigbee_Check_Firmware_Info(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    App_Zigbee_Error((uint32_t)ERR_ZIGBEE_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_ZB_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_ZB_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch (p_wireless_info->StackType)
    {
      case INFO_STACK_TYPE_ZIGBEE_FFD:
        APP_ZB_DBG("FW Type : FFD Zigbee stack");
        break;
      case INFO_STACK_TYPE_ZIGBEE_RFD:
        APP_ZB_DBG("FW Type : RFD Zigbee stack");
        break;
      default:
        /* No Zigbee device supported ! */
        App_Zigbee_Error((uint32_t)ERR_ZIGBEE_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
        break;
    }

    // print the application name
    char* __PathProject__ =(strstr(__FILE__, "Zigbee_") ? strstr(__FILE__, "Zigbee_") : __FILE__);
    char *del;
    if ( (strchr(__FILE__, '/')) == NULL)
    {del = strchr(__PathProject__, '\\');}
    else
    {del = strchr(__PathProject__, '/');}
    
    int index = (int) (del - __PathProject__);
    APP_ZB_DBG("Application flashed: %*.*s",index,index,__PathProject__);
    
    //print Link Key
    APP_ZB_DBG("Link Key: %.16s", sec_key_ha);
    //print Link Key value hex   
    char Z09_LL_string[ZB_SEC_KEYSIZE*3+1];
    Z09_LL_string[0]=0;
    for(int str_index=0; str_index < ZB_SEC_KEYSIZE; str_index++)
    {
      sprintf(&Z09_LL_string[str_index*3],"%02x ",sec_key_ha[str_index]);
    }
    APP_ZB_DBG("Link Key value: %s",Z09_LL_string);
  }
} /* App_Zigbee_Check_Firmware_Info */

/**
 * @brief  Initialize Zigbee stack instance for the device
 * @param  None
 * @retval None
 */
void App_Zigbee_StackLayersInit(void)
{
  APP_ZB_DBG("App_Zigbee_StackLayersInit");

  app_zb_info.zb = ZbInit(0U, NULL, NULL); 
  assert(app_zb_info.zb != NULL);

