stm32-hotspot/STM32WB-ZB-RUC-WindowCovering/Projects/P-NUCLEO-WB55.Nucleo/RUC/Zigbee/Zigbee_Coord/STM32_WPAN/App/app_zigbee.c
  /* Configure the joining parameters */
  app_zb_info.join_status = ZCL_STATUS_FAILURE; /* init to error status */
  app_zb_info.join_delay  = HAL_GetTick();      /* now */

  /* First we disable the persistent notification */
  ZbPersistNotifyRegister(app_zb_info.zb, NULL, NULL);

  /* Call a startup from persistence */
  app_zb_info.join_status = App_Startup_Persist(app_zb_info.zb);
  if (app_zb_info.join_status == ZB_STATUS_SUCCESS)
  {
    APP_ZB_DBG("SUCCESS restart from persistence");
    BSP_LED_On(LED_BLUE);
    BSP_LED_On(LED_GREEN);
    HAL_Delay(300);
    BSP_LED_Off(LED_BLUE);
    BSP_LED_Off(LED_GREEN);
    HAL_Delay(300);
    BSP_LED_On(LED_BLUE);
    BSP_LED_On(LED_GREEN);
    HAL_Delay(300);
    BSP_LED_Off(LED_BLUE);
    BSP_LED_Off(LED_GREEN);
  }
  else
  {
    APP_ZB_DBG("FAILED to restart from persistence with status: 0x%02x",app_zb_info.join_status);
  }
} /* App_Zigbee_StackLayersInit */

/**
 * @brief  Handle Zigbee network Forming
 * @param  None
 * @retval None
 */
static void App_Zigbee_NwkForm(void)
{
  if ((app_zb_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= app_zb_info.join_delay))
  {
    struct ZbStartupT config;
   
    /* Configure Zigbee Logging (only need to do this once, but this is a good place to put it) */
    ZbSetLogging(app_zb_info.zb, ZB_LOG_MASK_LEVEL_5, NULL);

    /* Attempt to join a zigbee network */
    ZbStartupConfigGetProDefaults(&config);

    APP_ZB_DBG("Network config : APP_STARTUP_CENTRALIZED_COORD");
    config.startupControl = ZbStartTypeForm;

    /* Using the default HA preconfigured Link Key */
    memcpy(config.security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE);   
  
    /* Multi-channel prog */
    config.channelList.count = 1;
    config.channelList.list[0].page = 0;
    config.channelList.list[0].channelMask = CHANNELMASK_USED; /* Channel in use*/

    /* Using ZbStartupWait (blocking) here instead of ZbStartup, in order to demonstrate how to do
     * a blocking call on the M4. */
    app_zb_info.join_status = ZbStartupWait(app_zb_info.zb, &config);
    APP_ZB_DBG("ZbStartup Callback (status = 0x%02x)", app_zb_info.join_status);

    if (app_zb_info.join_status == ZB_STATUS_SUCCESS)
    {
      app_zb_info.join_delay = 0U;
      /* Register Persistent data change notification */
      ZbPersistNotifyRegister(app_zb_info.zb, App_Persist_Notify_cb, NULL);
      /* Call the callback once here to save persistence data */
      App_Persist_Notify_cb(app_zb_info.zb, NULL);
      /* flash x2 Green LED to inform the joining connection*/
      BSP_LED_On(LED_GREEN);
      HAL_Delay(300);
      BSP_LED_Off(LED_GREEN);
      HAL_Delay(300);
      BSP_LED_On(LED_GREEN);
      HAL_Delay(300);
      BSP_LED_Off(LED_GREEN);
    }
    else
    {
       APP_ZB_DBG("Startup failed, attempting again to form a network after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY);
      app_zb_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
    }
  }

  /* Indicates that the Task to form the Netwrork is done */
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_NETWORK_FORM);
} /* App_Zigbee_NwkJoin */

/**
 * @brief  Get the Zigbee network channel used
 * @param  mask channel mask
 * @param  first_channel first channel found
 * @retval numbers of channel found
 */
static uint8_t App_Zigbee_Get_Channel(uint32_t mask, uint16_t *first_channel)
{
  uint8_t i, num_channels = 0;

  *first_channel = 0xff;
  for (i = 0; i < WPAN_PAGE_CHANNELS_MAX; i++)
  {
    if (((1 << i) & mask))
    {
      if (num_channels == 0U)
      {
        *first_channel = i;
      }
      num_channels++;
    }
  }
  return num_channels;
} /* App_Zigbee_Get_Channel */

/**
 * @brief  Update Display Channel used
 * @param  None
 * @retval None
 */
void App_Zigbee_Channel_Disp(void)
{
  struct ZbChannelListT channelList;
  unsigned int i;

  /* Get the channel number used for the network and display it */
  (void)ZbNwkGet(app_zb_info.zb, ZB_NWK_NIB_ID_ActiveChannelList, &channelList, sizeof(struct ZbChannelListT));
  for (i = 0; i < channelList.count; i++)
  {
    uint8_t num_channels;
    uint16_t active_channel;

    num_channels = App_Zigbee_Get_Channel(channelList.list[i].channelMask, &active_channel);

    /* Display channel information to user */
    if (num_channels == 1)
    {
      /* active channel is available */
      APP_ZB_DBG("Join Channel : %2d", active_channel);
    }
  }
} /* App_Zigbee_Channel_Disp */

/**
 * @brief Set the Tx Power to the value
 * @param  None
 * @retval None
 */
static void App_Zigbee_Set_TxPwr(int8_t updated_val_tx_power)
{
  int8_t new_tx_power = 0;
  
  /* Check if the Zigbee Stack is initialised */
  if (app_zb_info.zb == NULL)
  {
    return;
  }

  /* Check the Tx Power saturation */
  if (updated_val_tx_power < TX_POWER_MAX)
  {
    new_tx_power = updated_val_tx_power;
  }
  else
  {
    new_tx_power = TX_POWER_MAX;
  }

  // Set the new Tx Power
  if (ZbNwkIfSetTxPower(app_zb_info.zb, "wpan0", new_tx_power) == true)
  {
    tx_power = new_tx_power; /* Update internal value */
    App_Zigbee_TxPwr_Disp();
  }
} /* App_Zigbee_Set_TxPwr */

/**
 * @brief Increment the Tx Power, Up to TX_POWER_MAX
 * @param  None
 * @retval None
 */
void App_Zigbee_TxPwr_Up(void)
{
  App_Zigbee_Set_TxPwr(tx_power + TX_POWER_STEP);
} /* App_Zigbee_TxPwr_Up */

/**
 * @brief Decrement the Tx Power, Down to TX_POWER_MIN
 * @param  None
 * @retval None
 */
void App_Zigbee_TxPwr_Down(void)
{
  App_Zigbee_Set_TxPwr(tx_power - TX_POWER_STEP);
} /* App_Zigbee_TxPwr_Down */

/**
 * @brief Display the new Value of Tx Power on LCD
 * @param  None
 * @retval None
 */
void App_Zigbee_TxPwr_Disp(void)
{
  APP_ZB_DBG("Tx Power : %2d dbm", tx_power);
} /* App_Zigbee_TxPwr_Disp */

/**
 * @brief  Send the request to NWK layer a Permit to Join the network
 * @param  None
 * @retval None
 */
void App_Zigbee_Permit_Join(void)
{
  struct ZbZdoPermitJoinReqT req;
  enum ZbStatusCodeT status;
  
  memset(&req, 0, sizeof(req));
  req.destAddr       = ZB_NWK_ADDR_BCAST_ROUTERS;
  req.tcSignificance = true;
  req.duration       = PERMIT_JOIN_DELAY;

  APP_ZB_DBG("Permit join during %ds", PERMIT_JOIN_DELAY);
  
