stm32-hotspot/STM32WB-ZB-RUC-WindowCovering/Projects/P-NUCLEO-WB55.Nucleo/RUC/Zigbee/Zigbee_Coord/STM32_WPAN/App/app_zigbee.c
  status = ZbZdoPermitJoinReq(app_zb_info.zb, &req, App_Zigbee_Permit_Join_cb, NULL);
  UNUSED(status);
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_PERMIT_JOIN_REQ_RSP);  
} /* App_Zigbee_Permit_Join */

/**
 * @brief  Callback function to manage the completion of the Permit Join request
 * @param  None
 * @retval None
 */
static void App_Zigbee_Permit_Join_cb(struct ZbZdoPermitJoinRspT *rsp, void *arg)
{
  UNUSED(arg);
  
  if(rsp->status != ZB_STATUS_SUCCESS){
    APP_ZB_DBG("Error, cannot set permit join duration");
  } else {
    APP_ZB_DBG("Permit join duration successfully changed.");
  }
  
  /* Unlock the waiting on this event */
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_PERMIT_JOIN_REQ_RSP);
} /* App_Zigbee_Permit_Join_cb */

/**
 * @brief Send an Unbind Req foreach device of the binding table 
 * to Use with the Factory reset to clean the network before leave it
 * 
 * @param  None
 * @retval None
 */
void App_Zigbee_Unbind_All(void)
{
  struct ZbApsmeBindT  entry;
  struct ZbZdoBindReqT req;
  enum   ZbStatusCodeT status;

  APP_ZB_DBG("Unbind Devices below");
  APP_ZB_DBG(" Item | Long Address     |  ClusterId |  EP  |");
  APP_ZB_DBG(" -----|------------------|------------|------|");
  /* go through each elements to unbind them */
  for (uint8_t idx = 0; ; idx++)
  {
    /* check the end of the table */
    if (ZbApsGetIndex(app_zb_info.zb, ZB_APS_IB_ID_BINDING_TABLE, &entry, sizeof(entry), idx) != ZB_APS_STATUS_SUCCESS)
    {
      break;
    }
    /* remove itself */
    if (entry.srcExtAddr == 0ULL)
    {
      continue;
    }

    /* Invert src/dst from binding element to create unbind request */
    req.srcEndpt     = entry.dst.endpoint;
    req.srcExtAddr   = entry.dst.extAddr;
    req.dst.mode     = ZB_APSDE_ADDRMODE_EXT;
    req.dst.extAddr  = entry.srcExtAddr;
    req.dst.endpoint = entry.srcEndpt;
    req.clusterId    = entry.clusterId;
    /* be careful the API uses the target network address to send Unbind request (as Bind request) */
    req.target       = ZbNwkAddrLookupNwk(app_zb_info.zb, entry.dst.extAddr);
    /* check if resolution address found */
    if (req.target == ZB_NWK_ADDR_UNDEFINED)
    {
      APP_ZB_DBG("[Unbind Req] Nwk Add unknow");
      return;
    }
    /* display element and unbind it */
    APP_ZB_DBG("  %2d  | %016llx |    0x%03X   | 0x%02X |", idx, entry.dst.extAddr, entry.clusterId, entry.srcEndpt);
    status = ZbZdoUnbindReq(app_zb_info.zb, &req, &App_Zigbee_Unbind_cb, &req);
    if (status != ZB_STATUS_SUCCESS)
    {
      APP_ZB_DBG("UnbindReq status 0x%02X", status);
    }
  }
} /* App_Zigbee_Unbind_All */

/**
 * @brief Analyse the Device response for the Unbind Request
 *  
 * @param rsp from the device at the UnbindReq command
 * @param cb_arg unbind request to analyse
 */
static void App_Zigbee_Unbind_cb(struct ZbZdoBindRspT *rsp, void *cb_arg)
{
  struct ZbZdoBindReqT * req = cb_arg;

  if (rsp->status != ZB_STATUS_SUCCESS)
  {
    APP_ZB_DBG("Unbind Request Failed 0x%02X, investigate with following Request", rsp->status);
    APP_ZB_DBG(" Long Address     |  ClusterId |  EP  |");
    APP_ZB_DBG("------------------|------------|------|");
    APP_ZB_DBG(" %016llx |    0x%03X  | 0x%02X |", req->dst.extAddr, req->clusterId, req->srcEndpt);
    APP_ZB_DBG("");
  }
} /* App_Zigbee_Unbind_cb */

/**
 * @brief  For debug purpose, display the local binding table information
 * @param  None 
 * @retval None
 */
void App_Zigbee_Bind_Disp(void)
{
  struct ZbApsmeBindT entry;
  
  printf("\n\n\r");
  APP_ZB_DBG("-----------------------------------------------------------------");
  APP_ZB_DBG(" Item |   Long Address   | ClusterId | Src Endpoint | Dst Endpoint");
  APP_ZB_DBG(" -----|------------------|-----------|--------------|-------------");

  /* Loop on the Binding Table */
  for (uint8_t i = 0;; i++)
  {
    if (ZbApsGetIndex(app_zb_info.zb, ZB_APS_IB_ID_BINDING_TABLE, &entry, sizeof(entry), i) != ZB_APS_STATUS_SUCCESS)
    {
      break;
    }
    if (entry.srcExtAddr == 0ULL)
    {
      continue;
    }
    APP_ZB_DBG("  %2d  | %016llx |   0x%04x  |    0x%04x    |    0x%04x", i, entry.dst.extAddr, entry.clusterId, entry.srcEndpt, entry.dst.endpoint);
  }
  APP_ZB_DBG("---------------------------------------------------------------------------------\n\r");  
} /* App_Zigbee_Bind_Disp */


/*************************************************************
 * ZbStartupWait Blocking Call
 *************************************************************/
struct ZbStartupWaitInfo
{
  bool active;
  enum ZbStatusCodeT status;
};

static void ZbStartupWaitCb(enum ZbStatusCodeT status, void *arg)
{
  struct ZbStartupWaitInfo *info = arg;

  info->status = status;
  info->active = false;
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_STARTUP_ENDED);
} /* ZbStartupWaitCb */

/**
 * @brief  startup wait function
 * @param  zb Zigbee stack pointer
 * @param  config startup config pointer
 * @retval zigbee status stack code
 */
static enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config)
{
  struct ZbStartupWaitInfo *info;
  enum ZbStatusCodeT status;

  info = malloc(sizeof(struct ZbStartupWaitInfo));
  if (info == NULL)
  {
    return ZB_STATUS_ALLOC_FAIL;
  }
  memset(info, 0, sizeof(struct ZbStartupWaitInfo));

  info->active = true;
  status = ZbStartup(zb, config, ZbStartupWaitCb, info);
  if (status != ZB_STATUS_SUCCESS)
  {
    info->active = false;
    return status;
  }
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_STARTUP_ENDED);
  status = info->status;
  free(info);
  return status;
} /* ZbStartupWait */


/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Trace the error or the warning reported.
 * @param  ErrId
 * @param  ErrCode
 * @retval None
 */
void App_Zigbee_Error(uint32_t ErrId, uint32_t ErrCode)
{
  switch (ErrId)
  {
    default:
      App_Zigbee_TraceError("ERROR Unknown ", 0);
      break;
  }
} /* App_Zigbee_Error */

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (Zigbee or other module if any)
 * @retval None
 */
static void App_Zigbee_TraceError(const char *pMess, uint32_t ErrCode)
{
  APP_ZB_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
  while (1U == 1U)
  {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
  }
} /* App_Zigbee_TraceError */


